SHORT_PASSWORD = "Пароль слишком короткий"
NOT_APPROPRIATE_PASSWORD = "Пароль должен содержать минимум одну цифру,\
заглавную букву или спец символ"
USED_EMAIL = "Данный email уже используется"
SHORT_NAME_TEST = "Название теста должно быть не короче 4 символов"
SHORT_DURATION_TEST = "Время на тест должно быть не менее 5 минут (300 секунд)"
NO_CREATOR_ID_TEST = "Должно быть заполнено поле creator_id или user_id"
SHORT_DESCRIPTION_TEST = "Описание теста должно быть более 5 символов, если вы\
не можете придумать более длинное описание, просто не указывайте его"
SMALL_QUESTION_AM_COMP_TEST = "Количество вопросов для завершения теста должно\
быть больше 0"
EASY_Q_AM_TEST = "Количество вопросов с легкой сложностью для завершения теста\
должно быть больше 0 или можете просто не заполнять данное поле"
MED_Q_AM_TEST = "Количество вопросов с среденей сложностью для завершения\
теста должно быть больше 0 или можете просто не заполнять данное поле"
HARD_Q_AM_TEST = "Количество вопросов с высокой сложностью для завершения\
теста должно быть больше 0 или можете просто не заполнять данное поле"
WRONG_M_TYPE_TEST = "Способ оценивания результатов теста который вы выбрали не\
существует выберите 1(максимальная оценка),2(минимальная оценка),3(среднее\
значение),4(последний результат)"
NOT_NAME_DUR_DESC_TEST = "Одно из полей: quiz_name, duration, quiz_description\
должно обязательно быть заполнено"
SHORT_TEXT_QUESTION = "Вопрос должен быть не короче 3 символов"
SHORT_DESC_QUESTION = "Описание вопроса должно быть не короче 5 символов"
SHORT_TIME_QUESTION = "Время на вопрос должно быть более 10 секунд"
NO_TYPE_QUESTION = "Тип вопроса который вы выбрали не существует выберите 1\
(выбор одного вырианта ответа),2(выбор нескольких вариантов ответа),3(открытый\
ответ)"
SHORT_HINT_QUESTION = "Подсказка на вопрос должна быть не короче 5 символов"
NO_FILLED_QUESTION = "Одно из полей: question_text, question_description,\
question_time, question_points, question_number, question_difficulty,\
question_hint должно обязательно быть заполнено"
SHORT_TEXT_ANSWER = "Ответ должен быть не короче 2 символов"
ADD_OPT_FREE_ANSWER = "К вопросу со свободным ответом нельзя добавить варианты\
ответа"
NO_ADD_OPT_ANSWER = "К вопросу с выбором ответа нельзя добавить варианты\
ответа"
NO_TEXT_ANSWER = "Текстовый ответ должен быть не пустым"
MINUS_CONNECT_TIME = "Продолжительность отключения должна быть положительной"
TOO_LONG_DISCONNECT = "Продолжительность отключения не может быть длиннее \
сессии"
